NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_radiocore_peripherals.h
#define LRCCONF020_POWERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF020_RETAIN 0                          /*!< (unspecified)                                                        */
#define LRCCONF020_SYSTEMOFF 0                       /*!< (unspecified)                                                        */
#define LRCCONF020_LRCREQHFXO 0                      /*!< (unspecified)                                                        */
#define LRCCONF020_NCLK_MIN 0                        /*!< (unspecified)                                                        */
#define LRCCONF020_NCLK_MAX 7                        /*!< (unspecified)                                                        */
#define LRCCONF020_NCLK_SIZE 8                       /*!< (unspecified)                                                        */
#define LRCCONF020_CLKCTRL 0                         /*!< (unspecified)                                                        */
#define LRCCONF020_NACTPD_MIN 0                      /*!< (unspecified)                                                        */
#define LRCCONF020_NACTPD_MAX 7                      /*!< (unspecified)                                                        */
#define LRCCONF020_NACTPD_SIZE 8                     /*!< (unspecified)                                                        */
#define LRCCONF020_PDACT 0                           /*!< (unspecified)                                                        */
#define LRCCONF020_NPD_MIN 0                         /*!< (unspecified)                                                        */
#define LRCCONF020_NPD_MAX 7                         /*!< (unspecified)                                                        */
#define LRCCONF020_NPD_SIZE 8                        /*!< (unspecified)                                                        */
#define LRCCONF020_OTHERON 0                         /*!< (unspecified)                                                        */
#define LRCCONF020_NDOMAINS_MIN 0                    /*!< (unspecified)                                                        */
#define LRCCONF020_NDOMAINS_MAX 15                   /*!< (unspecified)                                                        */
#define LRCCONF020_NDOMAINS_SIZE 16                  /*!< (unspecified)                                                        */
#define LRCCONF020_AX2XWAITSTATES 0                  /*!< (unspecified)                                                        */
#define LRCCONF020_POWERON_MAIN_RESET 0              /*!< (unspecified)                                                        */
#define LRCCONF020_POWERON_ACT_RESET 0               /*!< (unspecified)                                                        */
#define LRCCONF020_RETAIN_MAIN_RESET 1               /*!< (unspecified)                                                        */
#define LRCCONF020_RETAIN_ACT_RESET 1                /*!< (unspecified)                                                        */

/*CPU Configuration*/
#define CPUCONF_PRESENT 1
#define CPUCONF_COUNT 1

#define CPUCONF_HASTASKERASECACHE 1                  /*!< (unspecified)                                                        */
#define CPUCONF_HASINITSVTOR 1                       /*!< (unspecified)                                                        */
#define CPUCONF_HASINITNSVTOR 1                      /*!< (unspecified)                                                        */
#define CPUCONF_HASCPUSTART 1                        /*!< (unspecified)                                                        */
#define CPUCONF_HASCPUWAIT 1                         /*!< (unspecified)                                                        */

/*Memory configuration*/
#define MEMCONF_PRESENT 1
#define MEMCONF_COUNT 1

#define MEMCONF_RETTRIM 1                            /*!< (unspecified)                                                        */
#define MEMCONF_REPAIR 0                             /*!< (unspecified)                                                        */
#define MEMCONF_POWER 1                              /*!< (unspecified)                                                        */

/*Watchdog Timer*/
#define WDT_PRESENT 1
#define WDT_COUNT 4

#define WDT010_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT010_HAS_INTEN 1                           /*!< (unspecified)                                                        */

#define WDT011_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT011_HAS_INTEN 1                           /*!< (unspecified)                                                        */

#define WDT131_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT131_HAS_INTEN 1                           /*!< (unspecified)                                                        */

#define WDT132_ALLOW_STOP 0                          /*!< (unspecified)                                                        */
#define WDT132_HAS_INTEN 1                           /*!< (unspecified)                                                        */

/*RESETINFO*/
#define RESETINFO_PRESENT 1
#define RESETINFO_COUNT 1

#define RESETINFO_HASRESETREAS 1                     /*!< (unspecified)                                                        */
#define RESETINFO_CROSSDOMAINRESET 0                 /*!< (unspecified)                                                        */

/*Distributed programmable peripheral interconnect controller*/
#define DPPIC_PRESENT 1
#define DPPIC_COUNT 10

#define DPPIC020_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC020_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC020_CH_NUM_MAX 31                       /*!< (unspecified)                                                        */
#define DPPIC020_CH_NUM_SIZE 32                      /*!< (unspecified)                                                        */
#define DPPIC020_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC020_GROUP_NUM_MAX 3                     /*!< (unspecified)                                                        */
#define DPPIC020_GROUP_NUM_SIZE 4                    /*!< (unspecified)                                                        */

#define DPPIC030_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC030_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC030_CH_NUM_MAX 15                       /*!< (unspecified)                                                        */
#define DPPIC030_CH_NUM_SIZE 16                      /*!< (unspecified)                                                        */
#define DPPIC030_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC030_GROUP_NUM_MAX 0                     /*!< (unspecified)                                                        */
#define DPPIC030_GROUP_NUM_SIZE 1                    /*!< (unspecified)                                                        */

#define DPPIC120_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC120_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC120_CH_NUM_MAX 7                        /*!< (unspecified)                                                        */
#define DPPIC120_CH_NUM_SIZE 8                       /*!< (unspecified)                                                        */
#define DPPIC120_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC120_GROUP_NUM_MAX 1                     /*!< (unspecified)                                                        */
#define DPPIC120_GROUP_NUM_SIZE 2                    /*!< (unspecified)                                                        */

#define DPPIC130_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC130_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC130_CH_NUM_MAX 7                        /*!< (unspecified)                                                        */
#define DPPIC130_CH_NUM_SIZE 8                       /*!< (unspecified)                                                        */
#define DPPIC130_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC130_GROUP_NUM_MAX 1                     /*!< (unspecified)                                                        */
#define DPPIC130_GROUP_NUM_SIZE 2                    /*!< (unspecified)                                                        */

#define DPPIC131_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC131_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC131_CH_NUM_MAX 7                        /*!< (unspecified)                                                        */
#define DPPIC131_CH_NUM_SIZE 8                       /*!< (unspecified)                                                        */
#define DPPIC131_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC131_GROUP_NUM_MAX 1                     /*!< (unspecified)                                                        */
#define DPPIC131_GROUP_NUM_SIZE 2                    /*!< (unspecified)                                                        */

#define DPPIC132_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC132_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC132_CH_NUM_MAX 7                        /*!< (unspecified)                                                        */
#define DPPIC132_CH_NUM_SIZE 8                       /*!< (unspecified)                                                        */
#define DPPIC132_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC132_GROUP_NUM_MAX 1                     /*!< (unspecified)                                                        */
#define DPPIC132_GROUP_NUM_SIZE 2                    /*!< (unspecified)                                                        */

#define DPPIC133_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC133_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC133_CH_NUM_MAX 7                        /*!< (unspecified)                                                        */
#define DPPIC133_CH_NUM_SIZE 8                       /*!< (unspecified)                                                        */
#define DPPIC133_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC133_GROUP_NUM_MAX 1                     /*!< (unspecified)                                                        */
#define DPPIC133_GROUP_NUM_SIZE 2                    /*!< (unspecified)                                                        */

#define DPPIC134_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC134_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC134_CH_NUM_MAX 7                        /*!< (unspecified)                                                        */
#define DPPIC134_CH_NUM_SIZE 8                       /*!< (unspecified)                                                        */
#define DPPIC134_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC134_GROUP_NUM_MAX 1                     /*!< (unspecified)                                                        */
#define DPPIC134_GROUP_NUM_SIZE 2                    /*!< (unspecified)                                                        */

#define DPPIC135_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC135_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC135_CH_NUM_MAX 7                        /*!< (unspecified)                                                        */
#define DPPIC135_CH_NUM_SIZE 8                       /*!< (unspecified)                                                        */
#define DPPIC135_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC135_GROUP_NUM_MAX 1                     /*!< (unspecified)                                                        */
#define DPPIC135_GROUP_NUM_SIZE 2                    /*!< (unspecified)                                                        */

#define DPPIC136_HASCHANNELGROUPS 1                  /*!< (unspecified)                                                        */
#define DPPIC136_CH_NUM_MIN 0                        /*!< (unspecified)                                                        */
#define DPPIC136_CH_NUM_MAX 7                        /*!< (unspecified)                                                        */
#define DPPIC136_CH_NUM_SIZE 8                       /*!< (unspecified)                                                        */
#define DPPIC136_GROUP_NUM_MIN 0                     /*!< (unspecified)                                                        */
#define DPPIC136_GROUP_NUM_MAX 1                     /*!< (unspecified)                                                        */
#define DPPIC136_GROUP_NUM_SIZE 2                    /*!< (unspecified)                                                        */

/*PPIB registers*/
#define PPIB_PRESENT 1
#define PPIB_COUNT 2

#define PPIB020_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB020_NTASKSEVENTS_MAX 15                  /*!< (unspecified)                                                        */
#define PPIB020_NTASKSEVENTS_SIZE 16                 /*!< (unspecified)                                                        */

#define PPIB030_NTASKSEVENTS_MIN 0                   /*!< (unspecified)                                                        */
#define PPIB030_NTASKSEVENTS_MAX 15                  /*!< (unspecified)                                                        */
#define PPIB030_NTASKSEVENTS_SIZE 16                 /*!< (unspecified)                                                        */

/*Event generator unit*/
#define EGU_PRESENT 1
#define EGU_COUNT 2

#define EGU020_PEND 0                                /*!< (unspecified)                                                        */
#define EGU020_CH_NUM_MIN 0                          /*!< (unspecified)                                                        */
#define EGU020_CH_NUM_MAX 15                         /*!< (unspecified)                                                        */
#define EGU020_CH_NUM_SIZE 16                        /*!< (unspecified)                                                        */

