NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h20/nrf54h20_radiocore_peripherals.h
#define TWIS133_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS133_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

#define TWIS134_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS134_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

#define TWIS135_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS135_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

#define TWIS136_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS136_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

#define TWIS137_EASYDMA_MAXCNT_MIN 0                 /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_MAXCNT_MAX 15                /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_MAXCNT_SIZE 16               /*!< (unspecified)                                                        */
#define TWIS137_EASYDMA_CURRENT_AMOUNT_REGISTER_INCLUDED 1 /*!< (unspecified)                                                  */

/* ============================================= SPU020 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU020.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_0    = 0,    /*!< Index of access permissions for channel 0 of IPCT                    */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_1    = 1,    /*!< Index of access permissions for channel 1 of IPCT                    */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_2    = 2,    /*!< Index of access permissions for channel 2 of IPCT                    */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_3    = 3,    /*!< Index of access permissions for channel 3 of IPCT                    */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_4    = 4,    /*!< Index of access permissions for channel 4 of IPCT                    */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_5    = 5,    /*!< Index of access permissions for channel 5 of IPCT                    */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_6    = 6,    /*!< Index of access permissions for channel 6 of IPCT                    */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_CH_7    = 7,    /*!< Index of access permissions for channel 7 of IPCT                    */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_INTERRUPT_0 = 24, /*!< Index of access permissions for interrupt 0 of IPCT                */
  NRF_RADIOCORE_SPU020_FEATURES_IPCT_INTERRUPT_1 = 25, /*!< Index of access permissions for interrupt 1 of IPCT                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_0 = 32,  /*!< Index of access permissions for channel 0 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_1 = 33,  /*!< Index of access permissions for channel 1 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_2 = 34,  /*!< Index of access permissions for channel 2 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_3 = 35,  /*!< Index of access permissions for channel 3 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_4 = 36,  /*!< Index of access permissions for channel 4 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_5 = 37,  /*!< Index of access permissions for channel 5 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_6 = 38,  /*!< Index of access permissions for channel 6 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_7 = 39,  /*!< Index of access permissions for channel 7 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_8 = 40,  /*!< Index of access permissions for channel 8 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_9 = 41,  /*!< Index of access permissions for channel 9 of DPPIC020                */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_10 = 42, /*!< Index of access permissions for channel 10 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_11 = 43, /*!< Index of access permissions for channel 11 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_12 = 44, /*!< Index of access permissions for channel 12 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_13 = 45, /*!< Index of access permissions for channel 13 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_14 = 46, /*!< Index of access permissions for channel 14 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_15 = 47, /*!< Index of access permissions for channel 15 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_16 = 48, /*!< Index of access permissions for channel 16 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_17 = 49, /*!< Index of access permissions for channel 17 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_18 = 50, /*!< Index of access permissions for channel 18 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_19 = 51, /*!< Index of access permissions for channel 19 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_20 = 52, /*!< Index of access permissions for channel 20 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_21 = 53, /*!< Index of access permissions for channel 21 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_22 = 54, /*!< Index of access permissions for channel 22 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_23 = 55, /*!< Index of access permissions for channel 23 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_24 = 56, /*!< Index of access permissions for channel 24 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_25 = 57, /*!< Index of access permissions for channel 25 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_26 = 58, /*!< Index of access permissions for channel 26 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_27 = 59, /*!< Index of access permissions for channel 27 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_28 = 60, /*!< Index of access permissions for channel 28 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_29 = 61, /*!< Index of access permissions for channel 29 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_30 = 62, /*!< Index of access permissions for channel 30 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CH_31 = 63, /*!< Index of access permissions for channel 31 of DPPIC020               */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CHG_0 = 64, /*!< Index of access permissions for channel group 0 of DPPIC020          */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CHG_1 = 65, /*!< Index of access permissions for channel group 1 of DPPIC020          */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CHG_2 = 66, /*!< Index of access permissions for channel group 2 of DPPIC020          */
  NRF_RADIOCORE_SPU020_FEATURES_DPPIC020_CHG_3 = 67, /*!< Index of access permissions for channel group 3 of DPPIC020          */
} NRF_RADIOCORE_SPU020_FEATURES_ENUM_t;

/* ============================================= SPU030 Split Security Features ============================================== */
/**
  * @brief Indexes in SPU030.FEATURES controlling access permissions of features with split security
  */
typedef enum {
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_0 = 32,  /*!< Index of access permissions for channel 0 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_1 = 33,  /*!< Index of access permissions for channel 1 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_2 = 34,  /*!< Index of access permissions for channel 2 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_3 = 35,  /*!< Index of access permissions for channel 3 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_4 = 36,  /*!< Index of access permissions for channel 4 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_5 = 37,  /*!< Index of access permissions for channel 5 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_6 = 38,  /*!< Index of access permissions for channel 6 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_7 = 39,  /*!< Index of access permissions for channel 7 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_8 = 40,  /*!< Index of access permissions for channel 8 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_9 = 41,  /*!< Index of access permissions for channel 9 of DPPIC030                */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_10 = 42, /*!< Index of access permissions for channel 10 of DPPIC030               */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_11 = 43, /*!< Index of access permissions for channel 11 of DPPIC030               */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_12 = 44, /*!< Index of access permissions for channel 12 of DPPIC030               */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_13 = 45, /*!< Index of access permissions for channel 13 of DPPIC030               */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_14 = 46, /*!< Index of access permissions for channel 14 of DPPIC030               */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CH_15 = 47, /*!< Index of access permissions for channel 15 of DPPIC030               */
  NRF_RADIOCORE_SPU030_FEATURES_DPPIC030_CHG_0 = 56, /*!< Index of access permissions for channel group 0 of DPPIC030          */
} NRF_RADIOCORE_SPU030_FEATURES_ENUM_t;


#ifdef __cplusplus
}
#endif
#endif /* NRF54H20_RADIOCORE_PERIPHERALS_H */

